# -*- coding: utf-8 -*-
import tensorflow as tf
import numpy as np
import matplotlib.pylab as plt

# 使用 TensorFlow 定义一个随机数构成的 2 * 20 的矩阵，并将其赋给变量 a
a = tf.random_normal([2, 20])
# a 是一个 Tensor("random_normal:0", shape=(2, 20), dtype=float32) 对象
sess = tf.Session()
out = sess.run(a)
"""
out 是一个 Numpy 数组，是类似下面结构的二维数组（具体数值随机生成可能有所差别）
[[ 1.12049484 -1.74728727  0.45890146  0.36703163 -0.15883297 -0.75236785
  -0.92546529  0.52383661 -0.76638812 -1.83311749  1.89417374 -1.08472025
  -0.45552248  0.15569194  0.31735975  0.01950244 -1.07766128 -0.79500329
  -0.8666485   0.39396518]
 [-1.57124853 -0.08938342 -0.55253559 -1.17106044  0.40585777  0.39375332
   1.37915421  0.19739513 -0.75434619  0.15933491 -0.75306702 -1.60337615
  -1.46187127  0.92681426  0.59408826  0.44740802 -1.06977224 -0.42683071
  -0.09084698  0.63764465]]
"""
x, y = out
# 将数组中的元素分别赋值给 x、y

# 使用 matplotlib.pylab 绘制一个散点图 x 对应横轴 y 对应竖轴
# 其实就是取出 x y 种索引相同的两个数后分别当做 横轴和竖轴显示成一个点
plt.scatter(x, y)
#显示绘制的图像
plt.show()